app/controllers/authors_controller.rb

UPDATE "authors" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["username", "pasha"], ["email", "admin111@example.com"], ["updated_at", 2016-09-05 15:50:55 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)